console.log(`Score: 270 / 270\n
- Вёрстка, дизайн, UI всех трёх страниц приложения +60\n
1. Стартовая страница приложения (вёрстка адаптивная - проверяется на ширине от 1920рх до 360рх) +20\n
2. Страница викторины (вёрстка адаптивная - проверяется на ширине от 1920рх до 360рх) +30\n
3. Страница с результатами (вёрстка адаптивная - проверяется на ширине от 1920рх до 360рх) +10\n
- Аудиоплеер +30\n
1. у кастомного аудиоплеера есть регулятор громкости звука +30(кастомный аудиоплеер сделан исходя из дизайна приложения)\n
- Верхняя панель страницы викторины +20\n
1. правильное отображение счета игры +10\n
2. текущий вопрос выделяется стилем +10\n
- Блок с вопросом +20\n
1. подстановка дефолтного изображения и замена названия птицы на символы (***), пока игрок не выберет правильный ответ +10\n
2. при выборе правильного ответа в блоке с вопросом отображается изображение и название загаданной птицы +10\n
- Блок с вариантами ответов +60\n
1. цветовая индикация правильного/неправильного ответа в виде индикаторов разного цвета рядом с названием птицы: +10\n
2. при выборе правильного или неправильного ответа издаются разные звуковые сигналы: +10\n
3. при выборе неправильного ответа проигрывание аудиоплеера не должно останавливаться: +10\n
4. при выборе правильно ответа проигрывание аудиоплеера должно остановиться: +10\n
5. при клике по названию птицы в блоке с описанием птицы отображается информацию о ней: +10\n
6. если правильный ответ уже дан, возможность просматривать описания птиц при клике по вариантам ответов остаётся, цвет индикаторов при этом не изменяется: +10\n
- Блок с описанием птицы: +30\n
1. пока игрок не кликнул по названию птицы из списка, в блоке выводится короткий текст с предложением послушать плеер и выбрать название птицы, чей голос прозвучал +10\n
2. при клике по названию птицы из списка, в блоке с описанием птицы появляется актуальная информация о ней +20\n
- Кнопка перехода к следующему вопросу +30\n
1. пока не выбран правильный ответ, кнопка не активна, нет возможности перейти к следующему заданию. Активное и неактивное состояние кнопки визуально отличаются, например, активная кнопка имеет зеленый, не активная - серый цвет +10\n
2. после правильного ответа на последний вопрос игрок переходит к странице с результатами викторины +10\n
3. страница с результатами содержит количество набранных баллов и кнопку с предложением сыграть ещё раз (или уведомление об окончании игры, если набрано максимальное количество баллов) +10\n
- Extra scope +20\n
1. локализация приложения на два языка, выбранный язык хранится в local storage и сохраняется при перезагрузке +10\n
2. создание галереи приложения c информацией (фото, аудио, название, описание) +10`)
